import React, {useContext, useEffect} from "react";
import "./ArticleTwo.css";
import { Link } from 'react-router-dom';
import Footer from "../components/Footer";
import AnimatedPage from "../AnimatedPage";
import UserContext from '../contexts/UserProvider';

const ArticleTwo = () => {
    // state ของ contextAPI
    const {dropdownClicked, setDropdownClicked} = useContext(UserContext);

    useEffect(() => {
        setDropdownClicked(false)
    },[])

    return (
        <AnimatedPage>
            <div className="article-2-container">
                <label className="article-2-header-label">การให้บริการรับฝากสัตว์เลี้ยง</label>
                <img src={require("../images/articleTwoPage/headerImg.png")}/>
                <p>
                    บริการรับฝากสัตว์เลี้ยงในไทยหมายถึงบริการที่ให้เจ้าของสัตว์เลี้ยงส่งสัตว์เข้ามาในสถานที่ที่มีผู้ดูแลเพื่อ
                    ดูแลสัตว์เลี้ยง ซึ่งบริการรับฝากสัตว์เลี้ยงมีหลายรูปแบบ รวมถึงศูนย์รับฝากสัตว์เลี้ยง, โรงแรมสัตว์เลี้ยง, 
                    บ้านเลี้ยงสัตว์, และบริการดูแลสัตว์เลี้ยงที่บ้านของผู้ให้บริการ บริการเหล่านี้อาจมีค่าใช้จ่ายและเงื่อนไขที่
                    แตกต่างกันไปตามสถานที่และบริการที่เลือกใช้
                </p>
                <label className="article-2-title-center">" ทำไมต้องใช้บริการรับฝากสัตว์เลี้ยง "</label>
                <p>
                    การรับฝากสัตว์เลี้ยงมักจะเป็นทางเลือกที่ดีสำหรับเจ้าของสัตว์เลี้ยงที่ต้องออกจากบ้านเป็นระยะเวลาหรือ
                    มีกิจกรรมที่ไม่สามารถพาสัตว์เลี้ยงไปด้วยได้ การมีผู้ดูแลสัตว์เลี้ยงช่วยให้สัตว์เลี้ยงได้รับการดูแลที่เหมาะ
                    สมในขณะที่เจ้าของอยู่ห่างจากบ้าน ซึ่งรวมถึงการให้อาหาร, การเดินเล่น, การดูแลสุขภาพ, และการให้
                    ความรักและความสนใจต่อสัตว์เลี้ยงของคุณในระยะเวลาที่คุณไม่อยู่ในบ้าน
                </p>
                <p>
                    การรับฝากสัตว์เลี้ยงในไทยมีหลากหลายรูปแบบและสถานที่ต่าง ๆ ที่เจ้าของสัตว์เลี้ยงสามารถเลือกใช้
                    บริการได้ ตัวอย่างของบริการรับฝากสัตว์เลี้ยงที่พบในไทยได้แก่
                </p>
                <div className="article-2-info-box">
                    <label className="article-2-title">1. ศูนย์รับฝากสัตว์เลี้ยง</label>
                    <p>
                        ศูนย์รับฝากสัตว์เลี้ยงมักเป็นสถานที่ที่มีบุคลากรที่มีความรู้และประสบการณ์ในการดูแลสัตว์เลี้ยง
                        มักจะมีพื้นที่กว้างขวางสำหรับสัตว์เลี้ยงเดินเล่น และมีบริการอาหารและการดูแลสุขภาพให้กับ
                        สัตว์เลี้ยงที่ถูกฝากไว้ในระยะเวลาที่กำหนด ราคาและเงื่อนไขการให้บริการอาจแตกต่างกันไปตาม
                        ศูนย์รับฝากแต่ละแห่ง
                    </p>
                    <img src={require("../images/articleTwoPage/infoImg1.png")}/>
                </div>
                <div className="article-2-info-box">
                    <label className="article-2-title">2. โรงแรมสัตว์เลี้ยง</label>
                    <p>
                        โรงแรมสัตว์เลี้ยงเป็นสถานที่ที่เจ้าของสัตว์เลี้ยงสามารถฝากสัตว์เลี้ยงไว้ในระยะเวลาที่กำหนด 
                        โรงแรมสัตว์เลี้ยงมักมีห้องพักเล็ก ๆ ที่เหมาะสำหรับสัตว์เลี้ยง และมีบุคลากรที่ดูแลและให้บริการ
                        สัตว์เลี้ยงตลอดเวลา รวมถึงการให้อาหารและดูแลสุขภาพให้กับสัตว์เลี้ยง
                    </p>
                    <img src={require("../images/articleTwoPage/infoImg2.png")}/>
                </div>
                <div className="article-2-info-box">
                    <label className="article-2-title">3. บ้านเลี้ยงสัตว์</label>
                    <p>
                        บ้านเลี้ยงสัตว์เป็นบริการที่ผู้ให้บริการจะไปถึงบ้านของเจ้าของสัตว์เลี้ยงเพื่อดูแลสัตว์เลี้ยงในสถานที่
                        ที่สะดวกสบายและคุ้มค่า บริการอาจรวมถึงการให้อาหาร, การเดินเล่น, การทำความสะอาดสัตว์เลี้ยง, 
                        และการให้ความรักและความสนใจต่อสัตว์เลี้ยงของคุณในบ้านของคุณ
                    </p>
                    <img src={require("../images/articleTwoPage/infoImg3.png")}/>
                </div>
                <p className="article-2-p-with-border">
                    ในการเลือกใช้บริการรับฝากสัตว์เลี้ยง ควรทำการสอบถามและศึกษาข้อมูลเพิ่มเติมเกี่ยวกับสถานที่ 
                    และความเป็นมืออาชีพของบุคลากรที่ดูแลสัตว์เลี้ยง เพื่อให้มั่นใจว่าสัตว์เลี้ยงของคุณจะได้รับการดูแลที่ดี
                    ที่สุดในระหว่างการต้องการฝาก
                </p>
                <label className="article-2-title-center">" โอกาสที่ดีในการเริ่มธุรกิจสัตว์เลี้ยง "</label>
                <p>
                    ธุรกิจเกี่ยวกับสัตว์เลี้ยงที่จะทำให้คุณได้รับโอกาสทางธุรกิจที่มากกว่าเดิม ได้แก่ ธุรกิจการเปิดโรงแรมรับ
                    ฝากสัตว์ โดยธุรกิจนี้นับวันยิ่งเป็นที่ต้องการของตลาดมากขึ้น เนื่องจากเกือบทุกบ้านย่อมมีสัตว์เลี้ยง 
                    และเมื่อต้องเดินทางไปท่องเที่ยวต่างจังหวัด สิ่งที่เจ้าของกังวลมากที่สุดได้แก่ความเป็นอยู่ของสัตว์เลี้ยง
                    แสนรักของตนเองว่าจะอยู่อย่างไร การเปิดโรงแรมรับฝากสัตว์จึงถือเป็นโอกาสใหม่ของธุรกิจในประเทศไทย 
                    เนื่องจากปัจจุบันยังไม่มีโรงแรมรับฝากสัตว์เลี้ยงมากนัก จุดเด่นที่ต้องเน้นย้ำในเรื่องโรงแรมรับฝากสัตว์คือ
                    การดูแลสัตว์เป็นอย่างดีเหมือนสัตว์เลี้ยงของตนเอง เพราะยิ่งดูแลดีมากเท่าใดเจ้าของก็จะยิ่งประทับใจมากขึ้น
                    นำไปสู่การรู้จักธุรกิจของคุณในวงกว้าง
                </p>
                <div className="article-2-ref-box">
                    <label className="article-2-title">ที่มาของข้อมูลและรูปภาพประกอบ</label>
                    <Link className="article-2-link" to="https://www.punpro.com/p/10-hotel-for-pets-cat-dog-other" target="_blank" >https://www.punpro.com/p/10-hotel-for-pets-cat-dog-other</Link>
                    <Link className="article-2-link" to="https://pinegrovevetclinic.com/boarding/" target="_blank" >https://pinegrovevetclinic.com/boarding/</Link>
                    <Link className="article-2-link" to="https://www.pinterest.com/pin/559994534914793305/" target="_blank" >https://www.pinterest.com/pin/559994534914793305/</Link>
                    <Link className="article-2-link" to="https://www.ddproperty.com/%E0%B8%84%E0%B8%B9%E0%B9%88%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%8B%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%82%E0%B8%B2%E0%B8%A2/%E0%B8%81%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%B1%E0%B8%95%E0%B8%A7%E0%B9%8C%E0%B9%80%E0%B8%A5%E0%B8%B5%E0%B9%89%E0%B8%A2%E0%B8%87%E0%B9%83%E0%B8%99%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99-%E0%B8%95%E0%B9%89%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%95%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%A1%E0%B8%AD%E0%B8%B0%E0%B9%84%E0%B8%A3%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%87-45313" target="_blank" >https://www.ddproperty.com/</Link>
                </div>
            </div>
            <Footer/>
        </AnimatedPage>
    );
}
export default ArticleTwo;