import React from "react";
import "./TermOfService.css"
import Footer from "../components/Footer";
import AnimatedPage from "../AnimatedPage";
import { useEffect, useContext } from "react";
import UserContext from "../contexts/UserProvider";

const TermOfService = () => {

    // state ของ contextAPI
    const {dropdownClicked, setDropdownClicked} = useContext(UserContext);

    useEffect(() => {
        setDropdownClicked(false)
        document.body.classList.add('term-page');
        return () => {
            document.body.classList.remove('term-page');
        };
    }, []);

    return (
        <AnimatedPage>
            <div className="term-container">
                <label className="term-header">ข้อกำหนดการให้บริการของ KabiiXoo</label>
                <div className="term-box">
                    <label className="term-title">ข้อตกลงในการใช้บริการ (Term of Service)</label>
                    <label className="term-title-desc">
                        &emsp;&emsp;&emsp; เงื่อนไขและข้อตกลงนี้ ถือว่าเป็นเข้าใจกันดีแล้วทั้งสองฝ่าย ซึ่งต่อไปนี้ขอแทน เว็บไซต์ศูนย์กลางรับฝากสัตว์เลี้ยง (คาบิซู) ว่า “ผู้ให้บริการ” และแทนตัวท่านว่า “ผู้ใช้บริการ” โดย สมาชิกต้องยอมรับเงื่อนไขการใช้บริการต่างๆ ของ ผู้ให้บริการ ดังนี้
                    </label>
                    <p className="term">
                    1.&ensp;ผู้ให้บริการ ขอสงวนสิทธิ์ตามดุลยพินิจของตนแต่เพียงผู้เดียวในการเปลี่ยนแปลง ดัดแปลง หรือแก้ไขเงื่อนไขการใช้งานและเอกสารอื่นใดที่รวมอยู่ใน
    การอ้างอิงในที่นี้ได้ตลอดเวลา และ และผู้ให้บริการ จะโพสต์ประกาศการเปลี่ยนแปลงและเงื่อนไขการใช้งานที่แก้ไขเพิ่มเติม หรืออาจแจ้งการแก้ไขผ่าน
    วิธีการติดต่อที่เป็นลายลักษณ์อักษรใดๆ ที่ ผู้ให้บริการ ได้กำหนดไว้กับคุณ คุณมีหน้าที่รับผิดชอบในการตรวจสอบข้อกำหนดการใช้งานสำหรับการ
    เปลี่ยนแปลงใดๆ การใช้งานแพลตฟอร์มของคุณหลังจากการแก้ไขข้อกำหนดการใช้งานใด ๆ จะเป็นการแสดงว่าคุณยินยอมและยอมรับข้อกำหนดการ
    ใช้งานที่แก้ไขแล้ว หากคุณไม่ยอมรับที่จะปฏิบัติตามข้อกำหนดการใช้งานเหล่านี้หรือในอนาคต โปรดอย่าใช้หรือเข้าถึงเว็บไซต์
                    </p>
                    <p className="term">
                    2.&ensp;ผู้ใช้บริการต้องให้ข้อมูลที่เป็นจริงเกี่ยวกับตัวผู้ใช้บริการในทุกๆข้อมูลที่เว็บไซต์ต้องการได้รวมทั้ง E-mail Address ที่สามารถใช้งานได้ 
    ทั้งนี้เพื่อยืนยันความมีตัวตนของผู้ใช้บริการ
                    </p>
                    <p className="term">
                    3.&ensp;ผู้ให้บริการเป็นเพียงเว็บไซต์ศูนย์กลางรับฝากสัตว์เลี้ยง ไม่ได้เป็นผู้รับฝากสัตว์เลี้ยง ดังนั้นผู้ใช้บริการที่ก่อเหตุหรือความประพฤติที่ก่อเกิดให้เกิด
    ความเสียหายต่อผู้ใช้บริการรายอื่น ผู้ให้บริการจะไม่มีส่วนเกี่ยวข้องกับการรับผิดชอบใดๆทั้งนั้น ทั้งนี้ความปลอดภัยของสัตว์เลี้ยงของผู้ใช้บริการ 
    ผู้ใช้บริการที่เป็นผู้ให้บริการแต่ละคนจะมีนโยบายการคุ้มครองสัตว์เลี้ยงแตกต่างกันไป
                    </p>
                    <p className="term">
                    4.&ensp;การใช้งานเว็บไซต์ศูนย์กลางรับฝากสัตว์เลี้ยง ข้อมูลการลงทะเบียนทั้งหมดที่คุณส่งมาเป็น
    ความจริงและถูกต้อง รวมทั้งคุณจะรักษาความถูกต้องของข้อมูลดังกล่าว และ ข้อมูลของคุณ ในการใช้เว็บไซต์ไม่ละเมิดกฎหมายหรือข้อบังคับใดๆ 
    หากตรวจสอบและพบว่าข้อมูลนั้นไม่ผ่านคุณสมบัติ ผู้ให้บริการจะทำการลบบัญชีผู้ใช้งาน ของผู้ใช้บริการทันที
                    </p>
                    <p className="term">
                    5.&ensp;ผู้ใช้บริการที่เป็นผู้ให้บริการห้ามเลือกปฏิบัติต่อผู้ใช้บริการรายอื่น ไม่ว่าจะเป็นเชื้อชาติ สีผิว ศาสนา เพศ ชาติกำเนิด อายุ ความพิการ หรือชนชั้น 
    ถ้าผู้ให้บริการตรวจสอบพบจะทำการลบบัญชีผู้ใช้งาน ของผู้ใช้บริการทันที
                    </p>
                    <p className="term">
                    6.&ensp;ราคาทั้งหมดสำหรับบริการที่เสนอโดยผู้ให้บริการนั้นขึ้นอยู่กับการตัดสินใจของผู้ให้บริการแต่เพียงผู้เดียว ผู้ให้บริการไม่มีส่วนร่วมในการตัดสินใจ
    เรื่องราคาที่เสนอต่อผู้ใช้บริการ ผู้ใช้บริการที่เป็นผู้ให้บริการจำเป็นต้องหารือกับผู้ใช้บริการและตกลงราคาสุดท้ายก่อนเริ่มบริการ
                    </p>
                    <p className="term">
                    7.&ensp;ผู้ใช้บริการที่เป็นผู้ให้บริการต้องดำเนินการและส่งมอบบริการและหรือสินค้าที่ตกลงร่วมกันกับผู้ใช้บริการด้วยคุณภาพและความเป็นมืออาชีพสูงสุด 
    บริการจะต้องส่งมอบตรงเวลาและการยกเลิกหรือเปลี่ยนแปลงวันที่และเวลาจะต้องสื่อสารโดยตรงกับผู้ใช้บริการ ผู้ใช้บริการมีสิทธิ์ตรวจสอบและแสดง
    ความคิดเห็นเกี่ยวกับคุณภาพของบริการ หากบริการไม่ได้คุณภาพที่ผู้ใช้บริการยอมรับได้ ผู้ใช้บริการสามารถรายงานผู้ใช้บริการที่เป็นผู้ให้บริการได้
                    </p>
                    <p className="term endLine">
                    8.&ensp;ผู้ใช้บริการที่เป็นผู้ให้บริการต้องอนุญาติให้ผู้ใช้บริการที่ใช้บริการกับตนรีวิวและให้คะแนนได้หลังจากได้รับบริการ ถ้าหากผู้ใช้บริการที่เป็นผู้ให้บริการไม่อนุญาติให้รีวิวเมื่อผู้ใช้บริการต้องการรีวิว ผู้ใช้บริการสามารถรายงานผู้ใช้บริการที่เป็นผู้ให้บริการได้
                    </p>
                    <p className="term-conclusion">
                    &emsp;&emsp;&emsp; ข้อกำหนดเหล่านี้มีผลบังคับใช้ทันทีเมื่อผู้ใช้บริการตัดสินใจใช้บริการของเรา ให้ถือว่าผู้ใช้บริการตกลงยินยอมปฏิบัติตามข้อกำหนดทั้งหมดนี้
    แล้ว ทางเรามีสิทธิ์ที่จะปฏิเสธ และหรือ ยกเลิกการให้บริการกับสมาชิก โดยไม่แจ้งให้ทราบล่วงหน้า ผู้ในกรณีที่มีการกระทำที่ขัดต่อนโยบาย และ
    ข้อตกลง ในการให้บริการดังที่กล่าวมาข้างต้น และ หากเกิดกรณีพิพาทไม่ว่าเรื่องใดๆ ก็ตาม คำตัดสินของ ผู้ให้บริการ ถือเป็นที่สุด
                    </p>
                    <img className="term-logo" src={require("../images/logo2.png")}/>
                </div>
            </div>
            <Footer/>
        </AnimatedPage>
    );
}

export default TermOfService;